interface Page11Props {
  data: any
}

export default function Page10({ data }: Page11Props) {
   const userData = JSON.parse(localStorage.getItem("kcc_userjson") || "{}").userjson;
  return (
    <div className="p-6 h-full text-xs pdf-page">
      {/* Header */}
      <div className="text-center mb-8">
        <h1 className="text-lg font-bold">உறுதி மொழி சான்று</h1>
      </div>

      {/* Main Content */}
      <div className="text-justify space-y-6 leading-relaxed">
        <p>
      .......,சேலம் மாவட்ட மத்தியக் கூட்டுறவு வங்கியிலிருந்து,
       எங்களது எஸ். 1374 மகுடஞ்சாவடி தொடக்க வேளாண்மை
        கூட்டுறவு கடன் சங்கத்திற்கு அனுமதிக்கப்பட்டுள்ள KCC
         மற்றும் KCC-AH காசுக்கடன் நிதியுதவி /கடனுதவியிலிருந்து
          2025-2026-நிதியாண்டிற்கு பெற்று எங்களது விவசாய 
          அதே உறுப்பினர்களுக்கு வழங்கப்படும் நேர்வில்,
          
           உறுப்பினர்கள் பிற வங்கிகளில் விவசாயக் கடன் 
           பெற்றுள்ளதாக பின்னர் அறியவரும் நிலையில், 
           அதனால் 7% வட்டி மானியம் கிடைப்பதில் ஏதேனும் இடர்பாடு 
           ஏற்பட்டு அரசிடமிருந்து மானியமாக வர வேண்டிய வட்டித் தொகை
            மீளப்பெறாத சூழ்நிலையில், அந்நிதியிழப்பினை மத்திய வங்கிக்கு 
            திரும்பச் செலுத்தி நேர் செய்யும் பொருட்டு, எங்களது சங்கத்தின் சேமிப்பு கணக்கு / 
            நடப்பு கணக்கிலிருந்து பற்றெழுதி நேர்செய்து கொள்ள சம்மதம் தெரிவித்துக் கொள்கிறோம்
        </p>
      </div>

      <div className="text-right mt-16">
        <p>
          <strong>செயலாளர்</strong>
        </p>
      </div>
    </div>
  )
}
